vincent290587/nRF51/nRF51_SDK_9.0.0_2e23562/examples/multiprotocol/ble_ant_ancs_c/main.c
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        err_code = dm_security_status_req(&m_peer_handle, &status);
        APP_ERROR_CHECK(err_code);

        // If the link is still not secured by the peer, initiate security procedure.
        if (status == NOT_ENCRYPTED)
        {
            err_code = dm_security_setup_req(&m_peer_handle);
            APP_ERROR_CHECK(err_code);
        }
    }
}

// on fait un ping sur iOS pour eviter la deconnexion
static void sec_ping(void * p_context) {
    uint32_t err_code;

    err_code = ble_ancs_c_request_attrs(p_context);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for setting up GATTC notifications from the Notification Provider.
 *
 * @details This function is called when a successful connection has been established.
 */
static void apple_notification_setup(void)
{
    uint32_t err_code;

    nrf_delay_ms(100); // Delay because we cannot add a CCCD to close to starting encryption. iOS specific.

    err_code = ble_ancs_c_notif_source_notif_enable(&m_ancs_c);
    APP_ERROR_CHECK(err_code);

    err_code = ble_ancs_c_data_source_notif_enable(&m_ancs_c);
    APP_ERROR_CHECK(err_code);

    LOG("Notifications Enabled.\n\r");
}


/**@brief Function for printing an iOS notification.
 *
 * @param[in] p_notif  Pointer to the iOS notification.
 */
static void notif_print(ble_ancs_c_evt_notif_t * p_notif)
{
    LOG("\n\rNotification\n\r");
    LOG("Event %d :       %s\n", p_notif->evt_id, lit_eventid[p_notif->evt_id]);
    LOG("Category ID %d: %s\n\r\n\r", p_notif->category_id, lit_catid[p_notif->category_id]);
    //LOG("Category Cnt:%u\n", (unsigned int) p_notif->category_count);
    //LOG("UID:         %u\n\r", (unsigned int) p_notif->notif_uid);
	
	  //LOG("Title     : %s\n", m_attr_title);
	  //LOG("Subtitle  : %s\n", m_attr_subtitle);
	  //LOG("Message   : %s\n\r", m_attr_message);

    attr_to_print = 2;
    if (p_notif->evt_id == 0 && 
         (p_notif->category_id == 1 ||
          p_notif->category_id == 2 ||
          p_notif->category_id == 3)) {
	    printf("$ANCS,1, ,%s\n\r", lit_catid[p_notif->category_id]);
    }
	
	  memset(m_attr_title  , 0, ATTR_DATA_SIZE*sizeof(char));
	  memset(m_attr_message, 0, ATTR_DATA_SIZE*sizeof(char));

	  // BSP_LED_0_MASK  BSP_LED_1_MASK BSP_LED_2_MASK
    LEDS_ON(BSP_LED_0_MASK);
#ifndef BSP_SIMPLE
    nrf_delay_ms(200);
#endif
    LEDS_OFF(BSP_LED_0_MASK);

	  return;
}


/**@brief Function for printing iOS notification attribute data.
 * 
 * @param[in] p_attr         Pointer to an iOS notification attribute.
 * @param[in] ancs_attr_list Pointer to a list of attributes. Each entry in the list stores 
                             a pointer to its attribute data, which is to be printed.
 */
static void notif_attr_print(ble_ancs_c_evt_notif_attr_t * p_attr,
                             ble_ancs_c_attr_list_t      * ancs_attr_list)
{

	  LOG("\n\rNotif_attr_print\n\r");
  
    LOG("attr_to_print: %d\n\r", attr_to_print);
  
    if (p_attr->attr_len != 0)
    {
        LOG("%s: %s\n\r",
               lit_attrid[p_attr->attr_id],
               ancs_attr_list[p_attr->attr_id].p_attr_data);
    }
    else if (p_attr->attr_len == 0)
    {
        LOG("%s: (N/A)\n\r", lit_attrid[p_attr->attr_id]);
    }

	
  if (attr_to_print) {
    if (p_attr->attr_id==1) {
      memset(notif_title, 0, ATTR_DATA_SIZE);
	    memcpy(notif_title, ancs_attr_list[p_attr->attr_id].p_attr_data, 
        p_attr->attr_len > ATTR_DATA_SIZE ? ATTR_DATA_SIZE : p_attr->attr_len);
    } else if (p_attr->attr_id==3) {
      memset(notif_message, 0, ATTR_DATA_SIZE);
      memcpy(notif_message, ancs_attr_list[p_attr->attr_id].p_attr_data, 
        p_attr->attr_len > ATTR_DATA_SIZE ? ATTR_DATA_SIZE : p_attr->attr_len);
    }
    
    char *pos;
    pos = strstr(notif_message, "$");
    if (pos != 0) {
      *pos = 0;
    }
    pos = strstr(notif_message, "@");
    if (pos != 0) {
      *pos = 0;
    }
    
    if (p_attr->attr_id==1 || p_attr->attr_id==3) {
      if (attr_to_print==1) {
		    attr_to_print = 0;
        // on sort la notif
        printf("$ANCS,1,%s,%s\n\r", notif_title, notif_message);
	    } else if (attr_to_print > 0) {
        attr_to_print -= 1;
      } else {
        attr_to_print = 0;
      }
    }
    
  }
  
  
}


/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler.
    APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, true);

    // Create security request timer.
    err_code = app_timer_create(&m_sec_req_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                sec_req_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_sec_ping, APP_TIMER_MODE_REPEATED, sec_ping);
    APP_ERROR_CHECK(err_code);
  
    err_code = app_timer_create(&m_sec_hrm, APP_TIMER_MODE_SINGLE_SHOT, hrm_connect);
    APP_ERROR_CHECK(err_code);
  
    err_code = app_timer_create(&m_sec_cad, APP_TIMER_MODE_SINGLE_SHOT, cad_connect);
    APP_ERROR_CHECK(err_code);
  
}


/**@brief Function for handling the Apple Notification Service client.
 *
 * @details This function is called for all events in the Apple Notification client that
 *          are passed to the application.
 *
 * @param[in] p_evt  Event received from the Apple Notification Service client.
 */
static void on_ancs_c_evt(ble_ancs_c_evt_t * p_evt)
{
    uint32_t err_code = NRF_SUCCESS;

    switch (p_evt->evt_type)
    {
        case BLE_ANCS_C_EVT_DISCOVER_COMPLETE:
            LOG("Apple Notification Service discovered on the server.\n");
            apple_notification_setup();
            break;

        case BLE_ANCS_C_EVT_NOTIF:
            m_notification_latest = p_evt->notif;
            notif_print(&m_notification_latest);
            break;

        case BLE_ANCS_C_EVT_NOTIF_ATTRIBUTE:
            notif_attr_print(&p_evt->attr, p_evt->ancs_attr_list);
            break;

        case BLE_ANCS_C_EVT_DISCOVER_FAILED:
            // ANCS not found.
            if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
            {
                err_code = sd_ble_gap_disconnect(m_conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(err_code);
            }
            LOG("Apple Notification Service not discovered on the server.\n");
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the GAP.
 *
 * @details Use this function to set up all necessary GAP (Generic Access Profile)
 *          parameters of the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Apple Notification Service client errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void apple_notification_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = true;
    cp_init.evt_handler                    = NULL;
    cp_init.error_handler                  = conn_params_error_handler;

